src/InformationRegisters/ЗаказыСервисовДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыСервисовДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТрекНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипГрузоперевозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаказаСервисДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СервисыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СервисыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезПомощиСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексДоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис1СДоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис1СКурьер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ЗаказыСервисовДоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаказСервисаПоДокументуОснования(ДокументОснование) Экспорт
	
	ЗаказСервиса = Новый Структура;
	ЗаказСервиса.Вставить("ИдентификаторЗаказа", "");
	ЗаказСервиса.Вставить("ТрекНомер", "");
	ЗаказСервиса.Вставить("ТипГрузоперевозки", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыСервисовДоставки.ДокументОснование КАК ДокументОснование,
	|	ЗаказыСервисовДоставки.ИдентификаторЗаказа КАК ИдентификаторЗаказа,
	|	ЗаказыСервисовДоставки.ТрекНомер КАК ТрекНомер,
	|	ЗаказыСервисовДоставки.ТипГрузоперевозки КАК ТипГрузоперевозки
	|ИЗ
	|	РегистрСведений.ЗаказыСервисовДоставки КАК ЗаказыСервисовДоставки
	|ГДЕ
	|	ЗаказыСервисовДоставки.ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ЗаказСервиса;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЗаказСервиса, Выборка);
	Возврат ЗаказСервиса;
	
КонецФункции

Процедура ПроверитьЗаписатьДанныеПоДоставке(ДокументОснование, ТипГрузоперевозки, ИдентификаторЗаказа = "", ТрекНомер = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказыСервисовДоставки.ДокументОснование КАК ДокументОснование,
	|	ЗаказыСервисовДоставки.ИдентификаторЗаказа КАК ИдентификаторЗаказа,
	|	ЗаказыСервисовДоставки.ТрекНомер КАК ТрекНомер,
	|	ЗаказыСервисовДоставки.ТипГрузоперевозки КАК ТипГрузоперевозки,
	|	ЗаказыСервисовДоставки.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЗаказыСервисовДоставки КАК ЗаказыСервисовДоставки
	|ГДЕ
	|	ЗаказыСервисовДоставки.ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НоваяЗаписьРегистра = РегистрыСведений.ЗаказыСервисовДоставки.СоздатьМенеджерЗаписи();
	НоваяЗаписьРегистра.ДокументОснование = ДокументОснование;
	НоваяЗаписьРегистра.ТрекНомер = "";
	НоваяЗаписьРегистра.ИдентификаторЗаказа = ИдентификаторЗаказа;
	Если ТипЗнч(ТипГрузоперевозки) = Тип("Число") Тогда
		НоваяЗаписьРегистра.ТипГрузоперевозки = ТипГрузоперевозки;
	Иначе
		Если ТипГрузоперевозки = Перечисления.СервисыДоставки.Сервис1СДоставка Тогда
			НоваяЗаписьРегистра.ТипГрузоперевозки = 1;
		ИначеЕсли ТипГрузоперевозки = Перечисления.СервисыДоставки.Сервис1СКурьер Тогда
			НоваяЗаписьРегистра.ТипГрузоперевозки = 2;
		КонецЕсли;
	КонецЕсли;
	
	НоваяЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
